### INFO 3401

Relational data: applications

In [8]:
import numpy as np
import pandas as pd
import sqlite3
import os

## Prepare gamelogs

In [13]:
gamelog_files = [i for i in os.listdir('gamelogs/') if '.TXT' in i]


df = pd.read_csv('gamelogs/GL2019.TXT')

df.columns

Index(['20190320', '0', 'Wed', 'SEA', 'AL', '1', 'OAK', 'AL.1', '1.1', '9',
       ...
       'Jurickson Profar', '4.3', 'semim001', 'Marcus Semien', '6.4',
       'hundn001', 'Nick Hundley', '2.7', 'Unnamed: 159', 'Y'],
      dtype='object', length=161)

In [15]:
cols = pd.read_csv('http://bayesball.github.io/baseball/fields.csv')

cols

    Field number                 Description        Header
0              0                     Game ID       GAME_ID
1              1               Visiting team  AWAY_TEAM_ID
2              2                      Inning        INN_CT
3              3                Batting team   BAT_HOME_ID
4              4                        Outs       OUTS_CT
..           ...                         ...           ...
92            92  Fielder with second assist   ASS2_FLD_CD
93            93   Fielder with third assist   ASS3_FLD_CD
94            94  Fielder with fourth assist   ASS4_FLD_CD
95            95   Fielder with fifth assist   ASS5_FLD_CD
96            96                Event number      EVENT_ID

[97 rows x 3 columns]

In [16]:
master_gamelog_concat_dict = dict()

for i,filename in enumerate(gamelog_files):
    _df = pd.read_csv('./Gamelogs/'+filename,header=None)
    _df.columns = gamelog_columns
    master_gamelog_concat_dict[1871+i] = _df

In [17]:
complete_gamelog_df = pd.concat(master_gamelog_concat_dict.values(),
                                keys=master_gamelog_concat_dict.keys(),
                                names=['season','index']).reset_index(0).reset_index(drop=True)
print("There are {0:,} games in the gamelog".format(len(complete_gamelog_df)))
complete_gamelog_df.head()

There are 218,168 games in the gamelog

,season,date,game_number,day,visitor,visitor_lg,visitor_game_number,home,home_lg,home_game_number,...,home_batter_7_name,home_batter_7_pos,home_batter_8_id,home_batter_8_name,home_batter_8_pos,home_batter_9_id,home_batter_9_name,home_batter_9_pos,additional_info,acquisition
0,1871,18710504,0,Thu,CL1,na,1,FW1,na,1,...,Ed Mincher,7.0,mcdej101,James McDermott,8.0,kellb105,Bill Kelly,9.0,NaN,Y
1,1871,18710505,0,Fri,BS1,na,1,WS3,na,1,...,Asa Brainard,1.0,burrh101,Henry Burroughs,9.0,berth101,Henry Berthrong,8.0,HTBF,Y
2,1871,18710506,0,Sat,CL1,na,2,RC1,na,1,...,Pony Sager,6.0,birdg101,George Bird,7.0,stirg101,Gat Stires,9.0,NaN,Y
3,1871,18710508,0,Mon,CL1,na,3,CH1,na,1,...,Ed Duffy,6.0,pinke101,Ed Pinkham,5.0,zettg101,George Zettlein,1.0,NaN,Y
4,1871,18710509,0,Tue,BS1,na,2,TRO,na,1,...,Steve Bellan,5.0,pikel101,Lip Pike,3.0,cravb101,Bill Craver,6.0,HTBF,Y

In [38]:
complete_gamelog_df.to_sql(name='Gamelogs',con=conn,if_exists='replace',index=False,chunksize=1000)

## Prepare Lahman database

In [19]:
## Download the sqllite version of the Lahman database 

# http://www.seanlahman.com/baseball-archive/statistics/

In [35]:

import sqlite3

con = sqlite3.connect("lahmansbaseballdb.sqlite")

lahmans = pd.read_sql("SELECT * FROM main.sqlite_master WHERE type='table';", con=con)

lahmans

,type,name,tbl_name,rootpage,sql
0,table,allstarfull,allstarfull,2,"CREATE TABLE ""allstarfull"" (\n\t""ID"" INTEGER N..."
1,table,appearances,appearances,151,"CREATE TABLE ""appearances"" (\n\t""ID"" INTEGER N..."
2,table,awardsmanagers,awardsmanagers,3436,"CREATE TABLE ""awardsmanagers"" (\n\t""ID"" INTEGE..."
3,table,awardsplayers,awardsplayers,3445,"CREATE TABLE ""awardsplayers"" (\n\t""ID"" INTEGER..."
4,table,awardssharemanagers,awardssharemanagers,3603,"CREATE TABLE ""awardssharemanagers"" (\n\t""ID"" I..."
5,table,awardsshareplayers,awardsshareplayers,3622,"CREATE TABLE ""awardsshareplayers"" (\n\t""ID"" IN..."
6,table,batting,batting,3757,"CREATE TABLE ""batting"" (\n\t""ID"" INTEGER NOT N..."
7,table,battingpost,battingpost,6554,"CREATE TABLE ""battingpost"" (\n\t""ID"" INTEGER N..."
8,table,collegeplaying,collegeplaying,7006,"CREATE TABLE ""collegeplaying"" (\n\t""ID"" INTEGE..."
9,table,divisions,divisions,7282,"CREATE TABLE ""divisions"" (\n\t""ID"" INTEGER NOT..."
10,table,fielding,fielding,7285,"CREATE TABLE ""fielding"" (\n\t""ID"" INTEGER NOT ..."
11,table,fieldingof,fieldingof,10906,"CREATE TABLE ""fieldingof"" (\n\t""ID"" INTEGER NO..."
12,table,fieldingofsplit,fieldingofsplit,11052,"CREATE TABLE ""fieldingofsplit"" (\n\t""ID"" INTEG..."
13,table,fieldingpost,fieldingpost,11878,"CREATE TABLE ""fieldingpost"" (\n\t""ID"" INTEGER ..."
14,table,halloffame,halloffame,12236,"CREATE TABLE ""halloffame"" (\n\t""ID"" INTEGER NO..."
15,table,homegames,homegames,12316,"CREATE TABLE ""homegames"" (\n\t""ID"" INTEGER NOT..."
16,table,leagues,leagues,12408,"CREATE TABLE ""leagues"" (\n\t""lgID"" CHARACTER(2..."
17,table,managers,managers,12410,"CREATE TABLE ""managers"" (\n\t""ID"" INTEGER NOT ..."
18,table,managershalf,managershalf,12504,"CREATE TABLE ""managershalf"" (\n\t""ID"" INTEGER ..."
19,table,parks,parks,12508,"CREATE TABLE ""parks"" (\n\t""ID"" INTEGER NOT NUL..."
20,table,people,people,12513,"CREATE TABLE ""people"" (\n\t""playerID"" VARCHAR(..."
21,table,pitching,pitching,13457,"CREATE TABLE ""pitching"" (\n\t""ID"" INTEGER NOT ..."
22,table,pitchingpost,pitchingpost,15025,"CREATE TABLE ""pitchingpost"" (\n\t""ID"" INTEGER ..."
23,table,salaries,salaries,15209,"CREATE TABLE ""salaries"" (\n\t""ID"" INTEGER NOT ..."
24,table,schools,schools,15903,"CREATE TABLE ""schools"" (\n\t""schoolID"" VARCHAR..."
25,table,seriespost,seriespost,15928,"CREATE TABLE ""seriespost"" (\n\t""ID"" INTEGER NO..."
26,table,teams,teams,15939,"CREATE TABLE ""teams"" (\n\t""ID"" INTEGER NOT NUL..."
27,table,teamsfranchises,teamsfranchises,16111,"CREATE TABLE ""teamsfranchises"" (\n\t""franchID""..."
28,table,teamshalf,teamshalf,16113,"CREATE TABLE ""teamshalf"" (\n\t""ID"" INTEGER NOT..."